Revit 2027 API
AdvancedLayered.SurfaceRotation Property
 The property labeled "Rotation" from the "AdvancedLayered" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string SurfaceRotation { get; }
Public Shared ReadOnly Property SurfaceRotation As String
	Get
public:
static property String^ SurfaceRotation {
	String^ get ();
}
static member SurfaceRotation : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble". This property allows a connected asset.
See Also
Reference
AdvancedLayered Class
Autodesk.Revit.DB.Visual Namespace